exampleCase/canalorg/constant/kinematicCloudPositions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       vectorField;
    object      kinematicCloudPositions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


(
(1e-05 -0.00141 0)
(3e-05 -0.00141 0)
(5e-05 -0.00141 0)
(7e-05 -0.00141 0)
(9e-05 -0.00141 0)
(0.00011 -0.00141 0)
(0.00013 -0.00141 0)
(0.00015 -0.00141 0)
(0.00017 -0.00141 0)
(0.00019 -0.00141 0)
(0.00021 -0.00141 0)
(1e-05 -0.00139 0)
(3e-05 -0.00139 0)
(5e-05 -0.00139 0)
(7e-05 -0.00139 0)
(9e-05 -0.00139 0)
(0.00011 -0.00139 0)
(0.00013 -0.00139 0)
(0.00015 -0.00139 0)
(0.00017 -0.00139 0)
(0.00019 -0.00139 0)
(0.00021 -0.00139 0)
(1e-05 -0.00137 0)
(3e-05 -0.00137 0)
(5e-05 -0.00137 0)
(7e-05 -0.00137 0)
(9e-05 -0.00137 0)
(0.00011 -0.00137 0)
(0.00013 -0.00137 0)
(0.00015 -0.00137 0)
(0.00017 -0.00137 0)
(0.00019 -0.00137 0)
(0.00021 -0.00137 0)
(1e-05 -0.00135 0)
(3e-05 -0.00135 0)
(5e-05 -0.00135 0)
(7e-05 -0.00135 0)
(9e-05 -0.00135 0)
(0.00011 -0.00135 0)
(0.00013 -0.00135 0)
(0.00015 -0.00135 0)
(0.00017 -0.00135 0)
(0.00019 -0.00135 0)
(0.00021 -0.00135 0)
(1e-05 -0.00133 0)
(3e-05 -0.00133 0)
(5e-05 -0.00133 0)
(7e-05 -0.00133 0)
(9e-05 -0.00133 0)
(0.00011 -0.00133 0)
(0.00013 -0.00133 0)
(0.00015 -0.00133 0)
(0.00017 -0.00133 0)
(0.00019 -0.00133 0)
(0.00021 -0.00133 0)
(1e-05 -0.00131 0)
(3e-05 -0.00131 0)
(5e-05 -0.00131 0)
(7e-05 -0.00131 0)
(9e-05 -0.00131 0)
(0.00011 -0.00131 0)
(0.00013 -0.00131 0)
(0.00015 -0.00131 0)
(0.00017 -0.00131 0)
(0.00019 -0.00131 0)
(0.00021 -0.00131 0)
(1e-05 -0.00129 0)
(3e-05 -0.00129 0)
(5e-05 -0.00129 0)
(7e-05 -0.00129 0)
(9e-05 -0.00129 0)
(0.00011 -0.00129 0)
(0.00013 -0.00129 0)
(0.00015 -0.00129 0)
(0.00017 -0.00129 0)
(0.00019 -0.00129 0)
(0.00021 -0.00129 0)
(1e-05 -0.00127 0)
(3e-05 -0.00127 0)
(5e-05 -0.00127 0)
(7e-05 -0.00127 0)
(9e-05 -0.00127 0)
(0.00011 -0.00127 0)
(0.00013 -0.00127 0)
(0.00015 -0.00127 0)
(0.00017 -0.00127 0)
(0.00019 -0.00127 0)
(0.00021 -0.00127 0)
(1e-05 -0.00125 0)
(3e-05 -0.00125 0)
(5e-05 -0.00125 0)
(7e-05 -0.00125 0)
(9e-05 -0.00125 0)
(0.00011 -0.00125 0)
(0.00013 -0.00125 0)
(0.00015 -0.00125 0)
(0.00017 -0.00125 0)
(0.00019 -0.00125 0)
(0.00021 -0.00125 0)
...
)

// ************************************************************************* //
