exampleCase/canalorg/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  dev                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

BubbleRadius    BubbleRadius [0 0 0 0 0 0 0] 12.6e-6;
epsilonBubble   epsilonBubble [0 0 0 0 0 0 0] 1e-12;//to narrow the bubble interface
BubbleCenter    BubbleCenter [0 0 0 0 0 0 0] (0 500e-6 0);

pBubble         pBubble [ 1 -1 -2 0 0 0 0 ] 1687840999; //650e5;
pliquid         pliquid [ 1 -1 -2 0 0 0 0 ] 101325;
pfact           pfact [0 0 0 0 0 0 0] 1;

epsDtB          epsDtB [0 2 0 0 0 0 0] 4e-12;// used to smear the bubble interface

// ************************************************************************* //
