exampleCase/canalorg/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    //volScalarFieldValue alpha.water 0
    //volScalarFieldValue p_rgh 1e5
    //volScalarFieldValue p 1e5
    //volScalarFieldValue T 300
);

regions
(
/*
    sphereToCell
    {
        centre (0 2e-3 0);
        radius 1e-3;
        fieldValues
        (
            volScalarFieldValue alpha.water 1
        );
    }

    //sphereToFace
    sphereToCell
    {
        centre (0 0 0);
        radius 0.1e-3;
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue p_rgh 3.5e7
            volScalarFieldValue p 3.5e7
            volScalarFieldValue T 300
        );
    }
*/
    boxToCell
    {
	box (0 -1 -1) (1 -0.95e-3 1);
	fieldValues
	(
	    volScalarFieldValue alpha.water 0
	);
    }
);


// ************************************************************************* //
